# Reading and Writing from excel

In [19]:
import pandas as pd
#Writing a function which converts na values people column
def convert_people_cell(cell): 
    if cell == 'n.a.':
        return 'Sam Walton'
    return cell
def gen_converter(cell):
    if cell == 'n.a.':
        return None
    elif cell == 'Not Available':
        return None
    elif cell == "-1":
        return None
    return cell
    
df = pd.read_excel("Stock_data.xlsx", converters = {
    'people' : convert_people_cell,
    'eps' : gen_converter,
    'price' : gen_converter,
    'revenue' : gen_converter
})

df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0     Sam Walton
2    MSFT  -1.00       85    64.0     bill gates
3     RIL    NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata